<template>
  <section class="wrap">
    <vue-scroll>
      <div class="wrap__inner">
        <h1 class="tit">이용약관</h1>

        <!-- 1장 -->
        <div class="policy policy__depth1">
          <h2 class="policy__tit">제 1 장 총 칙</h2>
          <div class="policy__group">
            <h3 class="policy__stit">제 1 조 (목적)</h3>
            <p>
              본 약관은 메가존클라우드 주식회사(이하 '회사'라 한다)가 Digital
              Spectrum 2020
              <a href="https://dspectrum.com">(https://dspectrum.com)</a>을
              통하여 제공하는 서비스(이하 '서비스'라 한다)의 이용에 관한 제반
              사항을 규정하는 것을 목적으로 합니다.
            </p>
          </div>
          <div class="policy__group">
            <h3 class="policy__stit">제 2 조 (약관의 동의)</h3>
            <ol class="policy__depth2">
              <li>
                이 약관을 읽고 동의한 후 회원에 가입한 순간부터 본 약관은 효력을
                발생합니다.
              </li>
              <li>
                회사는 사전 고지 없이 이 약관의 내용을 변경할 수 있으며, 변경된
                약관은 웹 사이트에 변경 사실을 게시함으로써 효력을 발생합니다.
              </li>
            </ol>
          </div>
          <div class="policy__group">
            <h3 class="policy__stit">제 3 조 (약관 외 준칙)</h3>
            <p>
              이 약관에 명시되지 않은 사항은 전기통신기본법, 전기통신사업법,
              정보통신윤리위원회 심의규정, 정보통신 윤리강령, 프로그램 보호법 및
              기타 관련법령의 규정을 따릅니다.
            </p>
          </div>
          <div class="policy__group">
            <h3 class="policy__stit">제 4 조 (용어의 정의)</h3>
            <p>이 약관에서 사용하는 용어의 정의는 다음과 같습니다.</p>
            <ol class="policy__depth2">
              <li>
                이용자: 회사가 제공하는 서비스를 받는 자
              </li>
              <li>
                멤버십 등록: 회사가 제공하는 양식에 해당 정보를 기입하고, 본
                약관에 동의하여 서비스 이용 계약을 맺는 행위
              </li>
              <li>
                회원: 회사가 제공하는 가입 절차를 거쳐 등록한 자로, 회사의
                서비스를 제공받고 이용할 수 있는 자
              </li>
              <li>
                전자메일(e-mail): 회원 식별과 회원의 서비스 이용을 위하여 회원이
                선정한 문자와 숫자의 조합
              </li>
              <li>
                운영자: 서비스의 전반적인 관리와 원활한 운영을 위하여 회사에서
                선정한 사람
              </li>
              <li>
                탈퇴: 회사 또는 회원이 서비스 가입 이후 그 이용 계약을
                종료시키는 행위
              </li>
              <li>
                포인트: 본 사이트 내에서 세션 영상을 시청하거나 특정 활동을
                수행했을 때 정해진 기준에 따라 적립되며, 이벤트 응모 또는 경품
                교환 시 사용할 수 있는 수단
              </li>
            </ol>
            <p>
              이 약관에서 정의하지 않은 용어는 개별 서비스의 별도 약관이나 이용
              규정에서 정의합니다
            </p>
          </div>
        </div>

        <!-- 2장 -->
        <div class="policy policy__depth1">
          <h2 class="policy__tit">제 2 장 서비스 이용계약</h2>
          <div class="policy__group">
            <h3 class="policy__stit">제 5 조 (이용계약의 성립)</h3>
            <ol class="policy__depth2">
              <li>
                이용계약은 이용자가 인터넷을 통해 회사가 제시한 소정의 가입신청
                양식에 해당 사항을 기록하여 가입하는 것으로 성립됩니다.
              </li>
              <li>
                회사는 다음 각 항에 해당하는 경우 이용계약 성립을 유보할 수
                있습니다.
                <ol class="policy__depth3">
                  <li>① 서비스 관련 설비의 용량이 부족한 경우</li>
                  <li>② 기술상 장애 사유가 있는 경우</li>
                  <li>③ 기타 회사가 필요하다고 인정되는 경우</li>
                </ol>
              </li>
              <li>
                회사는 다음 각 항에 해당하는 경우 가입을 취소할 수 있습니다.
                <ol class="policy__depth3">
                  <li>① 이름이 실명이 아닌 경우</li>
                  <li>② 가입신청서의 내용을 허위로 기재한 경우</li>
                  <li>
                    ③ 사회의 안녕 질서 또는 미풍양속을 저해할 목적으로
                    신청하거나 그런 행위를 했을 경우
                  </li>
                  <li>
                    ④ 다른 회원의 서비스 이용을 방해하거나 인신공격, 비방 등으로
                    계속적인 문제를 일으킨 경우
                  </li>
                  <li>
                    ⑤ 기타 회사가 정한 이용신청요건을 충족하지 못하는 경우
                  </li>
                </ol>
              </li>
            </ol>
          </div>
        </div>

        <!-- 3장 -->
        <div class="policy policy__depth1">
          <h2 class="policy__tit">제 3 장 서비스 제공 및 이용</h2>
          <div class="policy__group">
            <h3 class="policy__stit">제 6 조 (서비스의 내용)</h3>
            <ol class="policy__depth2">
              <li>
                회사가 제공하는 서비스는 다음과 같습니다.
                <ol class="policy__depth3">
                  <li>① 회사에 대한 홍보 내용</li>
                  <li>② 기타 회사가 제공하는 각종 정보</li>
                  <li>③ 세션 영상 시청 서비스</li>
                  <li>④ 포인트 적립, 저장, 이용 서비스</li>
                  <li>⑤ 고객 상담 서비스</li>
                  <li>⑥ 이벤트 서비스</li>
                  <li>⑦ 문자 알림 서비스</li>
                  <li>⑧ 메일 서비스</li>
                </ol>
              </li>
              <li>
                회사는 필요한 경우 서비스의 내용을 추가 또는 변경할 수 있습니다.
              </li>
            </ol>
          </div>
          <div class="policy__group">
            <h3 class="policy__stit">제 7 조 (포인트 관련 규정)</h3>
            <ol class="policy__depth2">
              <li>
                포인트란, 본 사이트 내에서만 통용되며 사이트 이용 시 정해진
                기준에 따라 적립됩니다. 단, 현금으로 환불되지 않습니다.
              </li>
              <li>
                포인트는 세션 영상을 처음부터 끝까지 시청하거나 상담신청, 공유
                등의 참여를 통해 적립할 수 있습니다.
              </li>
              <li>
                적립된 포인트는 회원 탈퇴 혹은 서비스 제공 기간 만료 시점까지
                유효하며, 회원 탈퇴 시 자동 소멸되고 이후 재가입 시에도 포인트는
                복구되지 않습니다.
              </li>
              <li>
                회원이 포인트를 부당하게 취득한 증거가 있을 때에는 회사는 사전
                통지 없이 회원의 적립금을 삭제할 수 있으며 이와 관련하여 회원
                자격을 제한할 수 있습니다.
              </li>
              <li>
                포인트는 사용 즉시 차감되며 차감된 포인트는 취소 또는 복구되지
                않습니다.
              </li>
              <li>포인트는 타인과 교환하거나 양도할 수 없습니다.</li>
            </ol>
          </div>
          <div class="policy__group">
            <h3 class="policy__stit">제 8 조 (이벤트 관련 규정)</h3>
            <ol class="policy__depth2">
              <li>
                이벤트는 본 사이트에서 정해진 기간 내에 진행되며, 포인트를
                사용하거나 특정 미션을 달성한 후 참여할 수 있습니다.
              </li>
              <li>
                이벤트에 따라 정해진 기준을 충족했을 경우 참여가 가능하며 참여
                이후에는 취소할 수 없습니다.
              </li>
              <li>
                부적절한 방법으로 이벤트에 참여하거나 당첨된 경우, 사전 안내
                없이 참여 이력 삭제 및 당첨이 취소될 수 있습니다.
              </li>
              <li>
                각 이벤트 기간 및 당첨자 발표, 유의사항은 이벤트 페이지에 고지된
                내용을 기준으로 진행됩니다.
              </li>
              <li>
                5만원 이상의 경품에 대한 제세공과금은 당첨자 본인 부담이며,
                제세공과금 처리를 위한 추가 정보를 요구할 수 있습니다. 요구한
                개인정보에 대해 요청일로부터 1주 이내 회신이 없을 경우 자동으로
                당첨이 취소되며 이후에는 경품 수령이 불가능합니다.
              </li>
              <li>
                개인정보 입력 시 잘못된 주소와 연락처로 인한 미배송, 오배송은
                회사에서 책임지지 않으며 재배송되지 않습니다.
              </li>
              <li>정해진 경품 외 타 경품으로 교환 또는 환불은 불가능합니다.</li>
              <li>
                이벤트 기간 및 경품은 사전 고지 없이 변경될 수 있으며 조기
                종료될 수 있습니다.
              </li>
            </ol>
          </div>
          <div class="policy__group">
            <h3 class="policy__stit">제 9 조 (서비스의 요금)</h3>
            <p>회사가 제공하는 서비스는 모두 무료로 제공합니다.</p>
          </div>
          <div class="policy__group">
            <h3 class="policy__stit">제 10 조 (서비스의 개시)</h3>
            <p>
              서비스는 제5조에 따라서 이용계약이 성립된 때부터 즉시 개시됩니다.
              다만, 회사의 업무상 또는 기술상의 장애로 인하여 서비스를 즉시
              개시하지 못하는 경우 회사는 회원에게 이를 지체 없이 통지합니다.
            </p>
          </div>
          <div class="policy__group">
            <h3 class="policy__stit">제 11 조 (서비스 이용시간)</h3>
            <ol class="policy__depth2">
              <li>
                서비스 이용시간은 회사의 업무상 또는 기술상 장애, 기타 특별한
                사유가 없는 한 연중무휴, 1일 24시간을 원칙으로 합니다. 다만
                설비의 점검 등 회사가 필요한 경우 또는 설비의 장애, 서비스
                이용의 폭주 등 불가항력 사항으로 인하여 서비스 이용에 지장이
                있는 경우 예외적으로 서비스 이용의 전부 또는 일부에 대하여
                제한할 수 있습니다.
              </li>
              <li>
                회사는 제공하는 서비스 중 일부는 이용시간을 별도로 정할 수
                있으며, 이 경우 그 이용시간을 사전에 회원에게 공지 또는
                통지합니다.
              </li>
            </ol>
          </div>
          <div class="policy__group">
            <h3 class="policy__stit">제 12 조 (서비스 제공의 중지)</h3>
            <ol class="policy__depth2">
              <li>
                회사는 다음 각 항에 해당하는 경우 서비스의 제공을 중지할 수
                있습니다.
                <ol class="policy__depth3">
                  <li>
                    ① 천재지변의 발생이나 설비의 보수 등을 위하여 부득이한 경우
                  </li>
                  <li>
                    ② 전기통신사업법에 규정된 기간통신사업자가 전기통신서비스를
                    중지하는 경우
                  </li>
                  <li>
                    ③ 기타 회사가 서비스를 제공할 수 없는 사유가 발생한 경우
                  </li>
                  <li>④ 사전에 고지된 서비스 제공 기간이 만료된 경우</li>
                </ol>
              </li>
            </ol>
          </div>
        </div>

        <!-- 4장 -->
        <div class="policy policy__depth1">
          <h2 class="policy__tit">제 4 장 서비스와 관련한 권리·의무관계</h2>
          <div class="policy__group">
            <h3 class="policy__stit">제 13 조 (회사의 의무)</h3>
            <ol class="policy__depth2">
              <li>
                회사는 제12조에서 정한 경우를 제외하고는 이 약관에 따라
                계속적이고 안정적으로 서비스를 제공할 수 있도록 최선의 노력을
                다하여야 합니다.
              </li>
              <li>
                회사는 서비스에 관련된 설비를 항상 운용할 수 있는 상태로
                유지·보수하고, 장애가 발생하는 경우 지체 없이 이를 수리·복구할
                수 있도록 최선의 노력을 다하여야 합니다.
              </li>
              <li>
                회사는 서비스와 관련한 회원의 불만사항이 접수되는 경우 이를 즉시
                처리하여야 하며, 즉시 처리가 곤란한 경우 그 사유와 처리 일정을
                서비스 또는 전자우편을 통하여 동 회원에게 통지하여야 합니다.
              </li>
              <li>
                회사는 회원의 귀책사유로 인한 서비스 이용 장애에 대해서는 책임을
                지지 않습니다.
              </li>
            </ol>
          </div>
          <div class="policy__group">
            <h3 class="policy__stit">제 14 조 (회원의 의무)</h3>
            <ol class="policy__depth2">
              <li>
                회원은 관계법령, 이 약관의 규정, 이용안내 및 주의사항 등 회사가
                통지하는 사항을 준수하여야 하며, 회사의 업무나 다른 이용자의
                서비스 이용에 방해되는 행위를 하여서는 안됩니다.
              </li>
              <li>
                회원은 회사의 사전 승낙 없이 서비스를 이용하여 어떠한 영리
                행위도 할 수 없습니다.
              </li>
              <li>
                회원은 서비스를 이용하여 얻은 정보를 회사의 사전 승낙 없이 복사,
                복제, 변경, 번역, 출판·방송 기타의 방법으로 사용하거나 이를
                타인에게 제공할 수 없습니다.
              </li>
              <li>
                회원은 수강신청 시 개인정보 중에서 변경된 내용이 있는 경우
                서비스를 통하여 그 내용을 회사에 통지하여야 하며, 회원 자신의
                아이디(ID) 및 비밀번호를 제 3자에게 이용하게 해서는 안됩니다.
              </li>
              <li>
                회원은 서비스 이용과 관련하여 다음 각 호의 행위를 하여서는
                안됩니다.
                <ol class="policy__depth3">
                  <li>① 다른 회원의 아이디(ID)를 부정 사용하는 행위</li>
                  <li>
                    ② 범죄행위를 목적으로 하거나 기타 범죄행위와 관련된 행위
                  </li>
                  <li>③ 선량한 풍속, 기타 사회질서를 해하는 행위</li>
                  <li>④ 타인의 명예를 훼손하거나 모욕하는 행위</li>
                  <li>⑤ 타인의 지적재산권 등의 권리를 침해하는 행위</li>
                  <li>⑥ 해킹행위 또는 컴퓨터 바이러스의 유포행위</li>
                  <li>
                    ⑦ 타인의 의사에 반하여 광고성 정보 등 일정한 내용을
                    지속적으로 전송 또는 타 사이트를 링크하는 행위
                  </li>
                  <li>
                    ⑧ 서비스의 안전적인 운영에 지장을 주거나 줄 우려가 있는
                    일체의 행위
                  </li>
                </ol>
              </li>
            </ol>
          </div>
          <div class="policy__group">
            <h3 class="policy__stit">제 13 조 (회사의 의무)</h3>
            <ol class="policy__depth2">
              <li>
                회사는 회원의 개인정보에 대해서는 당사의 개인정보보호지침이
                적용됩니다.
              </li>
              <li>
                회사는 서비스와 관련하여 획득한 회원의 개인정보를 본인의 사전
                승낙 없이 제 3자에게 누설, 공개 또는 배포하지 않습니다. 단,
                다음의 경우에는 예외로 합니다.
              </li>
              <ol class="policy__depth3">
                <li>
                  ① 전기통신기본법 등 법률의 규정에 의해 국가기관의 요구가 있는
                  경우
                </li>
                <li>
                  ② 범죄에 대한 수사상의 목적이 있거나 정보통신윤리위원회의
                  요청이 있는 경우
                </li>
                <li>
                  ③ 통계작성, 학술연구 또는 시장조사를 위하여 필요한 경우로서
                  특정 개인을 식별할 수 없는 형태로 제공하는 경우
                </li>
                <li>④ 회원이 당사에 제3자 서비스제공 사실에 동의할 경우</li>
                <li>⑤ 기타 관계법령에 의한 경우</li>
              </ol>
              <li>
                회원은 개인정보의 보호 및 관리를 위하여 서비스의
                개인정보관리에서 수시로 자신의 개인정보를 수정, 삭제할 수
                있습니다.
              </li>
            </ol>
          </div>
        </div>

        <!-- 5장 -->
        <div class="policy policy__depth1">
          <h2 class="policy__tit">제5 장 기 타</h2>
          <div class="policy__group">
            <h3 class="policy__stit">제 16 조 (양도금지)</h3>
            <p>
              회원이 서비스의 이용권한, 기타 이용계약상 지위를 타인에게 양도,
              증여할 수 없으며 담보로 제공할 수 없습니다.
            </p>
          </div>

          <div class="policy__group">
            <h3 class="policy__stit">제 17 조 (탈퇴 및 이용제한)</h3>
            <ol class="policy__depth2">
              <li>
                회원은 언제든지 탈퇴를 요청할 수 있으며 회사는 즉시 회원탈퇴를
                처리합니다.
              </li>
              <li>
                회사는 회원이 제14조 대한 사항을 어겼을 경우 사전 통보 없이
                이용계약을 해지하거나 서비스 이용을 중지할 수 있습니다.
              </li>
              <li>
                회사는 2항에 의거 해지된 회원이 재 가입할 경우 그 승낙을 제한할
                수 있습니다.
              </li>
            </ol>
          </div>
          <div class="policy__group">
            <h3 class="policy__stit">제 18 조 (손해배상)</h3>
            <p>
              회사는 무료로 제공되는 서비스와 관련하여 회원에게 어떠한 손해가
              발생하더라도 회사가 고의로 행한 경우를 제외하고는 이에 대하여 책임
              부담 및 손해배상을 하지 않습니다.
            </p>
          </div>
          <div class="policy__group">
            <h3 class="policy__stit">제 19 조 (면책조항)</h3>
            <ol class="policy__depth2">
              <li>
                회사는 회원이 서비스에 게재한 정보, 자료, 사실의 정확성, 신뢰성
                등 그 내용에 관하여는 어떠한 책임도 지지 않습니다. 또한 회원들이
                게재한 정보에 의존해 어떤 손해나 이익이 발생하더라도 이에 대한
                모든 책임은 회원에게 있습니다.
              </li>
              <li>
                회사는 서비스를 매개로 하여, 회원간 또는 회원과 제3자간에
                물품거래 또는 금전적 거래 등과 관련하여 어떠한 책임도 부담하지
                않으며, 회원이 서비스의 이용과 관련하여 기대하는 이익에 관하여
                책임을 부담하지 않습니다.
              </li>
              <li>
                회원 아이디(ID)와 비밀번호의 관리 및 이용상의 부주의로 인하여
                발생되는 손해 또는 제3자에 의한 부정사용 등에 대한 책임은 모두
                회원 본인에게 있습니다.
              </li>
              <li>
                회원이 제20조, 기타 이 약관의 규정을 위반함으로써 회사가 회원
                또는 제3자에 대하여 책임을 부담하게 되고, 이로써 회사에게 손해가
                발생하게 되는 경우, 이 약관을 위반한 회원은 회사에게 발생하는
                모든 손해를 배상하여야 하며, 동 손해로부터 회사를 면책시켜야
                합니다.
              </li>
            </ol>
          </div>
          <div class="policy__group">
            <h3 class="policy__stit">제 20 조 (분쟁의 해결)</h3>
            <ol class="policy__depth2">
              <li>
                회사와 회원은 서비스와 관련하여 발생한 분쟁을 원만하게 해결하기
                위하여 필요한 모든 노력을 하여야 합니다.
              </li>
              <li>
                제1항에도 불구하고, 동 분쟁으로 인하여 소송이 제기될 경우 소송은
                회사의 소재지를 관할하는 법원의 관할로 합니다.
              </li>
            </ol>
          </div>
        </div>

        <!-- 부칙 -->
        <div class="policy__depth1">
          <h2 class="policy__tit">부칙</h2>
          <div class="policy__group">
            <h3 class="policy__stit">제 1 조 (시행일)</h3>
            <p>
              이 약관은 2020년 9월 1일부터 시행합니다.
            </p>
          </div>
        </div>
      </div>
    </vue-scroll>
  </section>
</template>

<script>
export default {
  name: 'Policy',
  mounted() {
    if (process.browser) {
    }
  }
}
</script>

<style lang="scss" scoped>
.wrap {
  height: var(--vh);
  &__inner {
    width: 1000px;
    margin: 0 auto;
    padding: 50px 0;
    & > .tit {
      font-size: 40px;
      text-align: center;
      font-weight: $font-bold;
    }
    a {
      color: #fff;
    }
  }
}

.policy {
  &__tit {
    font-size: 20px;
  }
  &__stit {
    margin: 20px 0 5px;
    display: inline-block;
  }

  // 리스트 시작
  &__group {
    line-height: 26px;
    word-break: keep-all;
  }
  // policy__depth1
  &__depth1 {
    margin: 80px 0;

    li {
      & > :not(:first-child) {
        //   padding-left: 20px;
        font-size: 14px;
      }
    }
  }
  // policy__depth2
  &__depth2 {
    & > li {
      list-style: decimal;
      list-style-position: inside;
    }
  }
  &__depth3 {
    padding-left: 16px;
  }
}
</style>
